bashyal/Applications/srcTestMain/cfd_dem/floatingCube/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    top
    {
        type            patch;
        nFaces          900;
        startFace       263100;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       264000;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12000;
        startFace       264900;
    }
)

// ************************************************************************* //
